.emacs.d/config.org
#+TITLE: Emacs Literate Configuration
#+AUTHOR: Sreedev Kodichath

* Package Management
** Setup MELPA
#+begin_src emacs-lisp
(require 'package)
(add-to-list 'package-archives
             '("melpa" . "https://melpa.org/packages/") t)
(package-refresh-contents)
(package-initialize)
#+end_src

** Installing Use Package
#+begin_src emacs-lisp
(unless (package-installed-p 'use-package)
        (package-install 'use-package))
#+end_src

* Evil Package Config
#+begin_src emacs-lisp
(use-package evil
  :ensure t ;; install evil if not installed
  :init     ;; tweake evil's configuration before loading it
  (setq evil-want-integration t) ;; optional as its already t by def
  (setq evil-want-keybinding nil)
  (setq evil-vsplit-window-right t)
  (setq evil-split-window-below t)
  (evil-mode))

(use-package evil-collection
  :after evil
        :ensure t
        :config
        (evil-collection-init))
#+end_src

* Theme
#+begin_src emacs-lisp
(use-package doom-themes
  :ensure t)
#+end_src
